# debugging მოიცავს სამ ეტაპს: კოდის ჩასმა , კოდის გამოსახვა , და გაშვებული კოდის გასწორება 
# bug არის კომპიუტერული ტერმინი  რომელიც ნიშნავს გაწედვას.ეს იმიტომ ეწოდება რომ პირველი კომპიუტერი ზომაში  ძალიან დიდი იყო. ერთ დყეს ის აღარ მუშაობდა შემდეგ აღმოაჩინეს რომ შგნით მწერი იყო 
# რიცხვითი მნიშვნელობა int  ეს გვეხმარება ცვენ რომ ამოვხსნათ მათემატიკური პრობლემები
#ტექსტური მნიშვნელობა str  იწერება ბრჭყალებეში.abs

x = 10
y = 20
print(x = y)

x = 25
y = 10
print(x - y)
  
  x = 30
  y = 10 
  print(x * y)

  x = 300 
  y = 30 
  print( x // y)

  x = 20 
  y = 6
  print(x / y)

  x = 200
  y= 100
  p= 100
  print(x + y - p)

  x = 300 
  y = 30 
  p = 10
  print((x // y) * p)

  x = 250 
  y = 150
  p = 10
  print((x - y) // 10)

  x = 20
  y = 10 
   p = 30
   print(x * y * p)

   x = 1000
   y = 100
   p = 90
   print((x // y) + p)

   x = 20
   p = 100
   y = 6
print(( x+ p )// 6)

x = 1000
y = 20 
p = 30 
print(x + y - p)

x = 10 
y = 100
p = 20
print(x * y // p)

x = 200
y = 100
print( x * y)

x = 1000
y = 100
p = 200 
v = 150
print((x + y - p ) // v)