/* ================================
class vs className
==================================
HTML-ში კლასის მისანიჭებლად გამოიყენება "class"
მაგრამ JSX-ში "class" არ გამოიყენება,
რადგან ის JavaScript-ის რეზერვირებული სიტყვაა.

React/JSX-ში ამის ნაცვლად ვიყენებთ "className"-ს,
რომ ელემენტს მივანიჭოთ CSS კლასი.
*/

/* ================================
Self-closing tags
==================================
Self-closing tag არის ტეგი,
რომელსაც არ აქვს დამხურავი ტეგი.

HTML-ში შეიძლება დაიწეროს ასე:
<img>
<br>

JSX-ში ყველა ასეთი ტეგი
აუცილებლად უნდა დაიხუროს თვითონ:
<img />
<br />
*/