//React არის JavaScript-ის ბიბლიოთეკა, რომელიც გამოიყენება ვებსაიტებისა და აპლიკაციების ინტერფეისების (UI) შესაქმნელად.

//React შექმნა Facebook-მა და დღეს ერთ-ერთი ყველაზე პოპულარული ტექნოლოგიაა თანამედროვე ვებდეველოპმენტში.


//React არის ინსტრუმენტი, რომლის დახმარებითაც იქმნება დინამიური, სწრაფი და კომფორტული ვებ-ინტერფეისები.
//იგი მუშაობს კომპონენტებზე — პატარა, ხელახლა გამოყენებად UI ნაწილებზე (მაგ: ღილაკი, მენიუ, ფორმა, ბარათი და ა.შ.)


//Vite არის ძალიან სწრაფი build tool (პროექტის ამშენებელი და გამშვები ინსტრუმენტი) თანამედროვე ვებდეველოპერებისთვის.

//Node.js არის გარემო, რომელიც საშუალებას გაძლევს JavaScript იმუშაოს არა ბრაუზერში, არამედ კომპიუტერზე/სერვერზე.z